bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA6490A.xml
                <register caption="Timer/Counter0 Interrupt Mask Register" name="TIMSK0" offset="0x6E" size="1">
                    <bitfield caption="Timer/Counter0 Output Compare Match Interrupt Enable" mask="0x02" name="OCIE0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
                </register>
                <register caption="Timer/Counter0 Interrupt Flag register" name="TIFR0" offset="0x35" size="1" ocd-rw="R">
                    <bitfield caption="Timer/Counter0 Output Compare Flag 0" mask="0x02" name="OCF0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x01" name="TOV0"/>
                </register>
                <register caption="General Timer/Control Register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset Timer/Counter1 and Timer/Counter0" mask="0x01" name="PSR310"/>
                </register>
            </register-group>
            <value-group caption="" name="WAVEFORM_GEN_MODE">
                <value caption="Normal" name="VAL_0x00" value="0x00"/>
                <value caption="PWM, Phase Correct" name="VAL_0x02" value="0x02"/>
                <value caption="CTC" name="VAL_0x01" value="0x01"/>
                <value caption="Fast PWM" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 16-bit" name="TC16">
            <register-group caption="Timer/Counter, 16-bit" name="TC1">
                <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x80" size="1">
                    <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM1A"/>
                    <bitfield caption="Compare Output Mode 1B, bits" mask="0x30" name="COM1B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM1"/>
                </register>
                <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x81" size="1">
                    <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
                    <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" lsb="2"/>
                    <bitfield caption="Prescaler source of Timer/Counter 1" mask="0x07" name="CS1" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter 1 Control Register C" name="TCCR1C" offset="0x82" size="1">
                    <bitfield caption="Force Output Compare 1A" mask="0x80" name="FOC1A"/>
                    <bitfield caption="Force Output Compare 1B" mask="0x40" name="FOC1B"/>
                </register>
                <register caption="Timer/Counter1 Bytes" name="TCNT1" offset="0x84" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register A Bytes" name="OCR1A" offset="0x88" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register B Bytes" name="OCR1B" offset="0x8A" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Input Capture Register Bytes" name="ICR1" offset="0x86" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Interrupt Mask Register" name="TIMSK1" offset="0x6F" size="1">
                    <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x20" name="ICIE1"/>
                    <bitfield caption="Timer/Counter1 Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE1B"/>
                    <bitfield caption="Timer/Counter1 Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x01" name="TOIE1"/>
                </register>
                <register caption="Timer/Counter1 Interrupt Flag register" name="TIFR1" offset="0x36" size="1" ocd-rw="R">
                    <bitfield caption="Input Capture Flag 1" mask="0x20" name="ICF1"/>
                    <bitfield caption="Output Compare Flag 1B" mask="0x04" name="OCF1B"/>
                    <bitfield caption="Output Compare Flag 1A" mask="0x02" name="OCF1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 8-bit Async" name="TC8_ASYNC">
            <register-group caption="Timer/Counter, 8-bit Async" name="TC2">
                <register caption="Timer/Counter2 Control Register" name="TCCR2A" offset="0xB0" size="1">
                    <bitfield caption="Force Output Compare A" mask="0x80" name="FOC2A"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x40" name="WGM20" values="WAVEFORM_GEN_MODE"/>
                    <bitfield caption="Compare Output Mode bits" mask="0x30" name="COM2A"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x08" name="WGM21"/>
                    <bitfield caption="Clock Select bits" mask="0x07" name="CS2" values="CLK_SEL_3BIT"/>
                </register>
                <register caption="Timer/Counter2" name="TCNT2" offset="0xB2" size="1" mask="0xFF"/>
                <register caption="Timer/Counter2 Output Compare Register" name="OCR2A" offset="0xB3" size="1" mask="0xFF"/>
                <register caption="Timer/Counter2 Interrupt Mask register" name="TIMSK2" offset="0x70" size="1">
                    <bitfield caption="Timer/Counter2 Output Compare Match Interrupt Enable" mask="0x02" name="OCIE2A"/>
                    <bitfield caption="Timer/Counter2 Overflow Interrupt Enable" mask="0x01" name="TOIE2"/>
                </register>
