bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA6490A.xml
                <register caption="LCD Data Register 6" name="LCDDR6" offset="0xF2" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 5" name="LCDDR5" offset="0xF1" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 4" name="LCDDR4" offset="0xF0" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 3" name="LCDDR3" offset="0xEF" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 2" name="LCDDR2" offset="0xEE" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 1" name="LCDDR1" offset="0xED" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 0" name="LCDDR0" offset="0xEC" size="1" mask="0xFF"/>
                <register caption="LCD Contrast Control Register" name="LCDCCR" offset="0xE7" size="1" mask="0xEF"/>
                <register caption="LCD Frame Rate Register" name="LCDFRR" offset="0xE6" size="1">
                    <bitfield caption="LCD Prescaler Selects" mask="0x70" name="LCDPS" values="LCD_PRESCALE"/>
                    <bitfield caption="LCD Clock Dividers" mask="0x07" name="LCDCD" values="MISC_3BIT_COUNT"/>
                </register>
                <register caption="LCD Control and Status Register B" name="LCDCRB" offset="0xE5" size="1">
                    <bitfield caption="LCD CLock Select" mask="0x80" name="LCDCS"/>
                    <bitfield caption="LCD 1/2 Bias Select" mask="0x40" name="LCD2B"/>
                    <bitfield caption="LCD Mux Selects" mask="0x30" name="LCDMUX"/>
                    <bitfield caption="LCD Port Masks" mask="0x0F" name="LCDPM" values="LCD_PORT_MASK_4BIT"/>
                </register>
                <register caption="LCD Control and Status Register A" name="LCDCRA" offset="0xE4" size="1" ocd-rw="R">
                    <bitfield caption="LCD Enable" mask="0x80" name="LCDEN"/>
                    <bitfield caption="LCD A or B waveform" mask="0x40" name="LCDAB"/>
                    <bitfield caption="LCD Interrupt Flag" mask="0x10" name="LCDIF"/>
                    <bitfield caption="LCD Interrupt Enable" mask="0x08" name="LCDIE"/>
                    <bitfield caption="LCD Blanking" mask="0x01" name="LCDBL"/>
                </register>
            </register-group>
            <value-group caption="" name="LCD_PRESCALE">
                <value caption="ClkLCD/16" name="VAL_0x00" value="0x00"/>
                <value caption="ClkLCD/64" name="VAL_0x01" value="0x01"/>
                <value caption="ClkLCD/128" name="VAL_0x02" value="0x02"/>
                <value caption="ClkLCD/256" name="VAL_0x03" value="0x03"/>
                <value caption="ClkLCD/512" name="VAL_0x04" value="0x04"/>
                <value caption="ClkLCD/1024" name="VAL_0x05" value="0x05"/>
                <value caption="ClkLCD/2048" name="VAL_0x06" value="0x06"/>
                <value caption="ClkLCD/4096" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="MISC_3BIT_COUNT">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="3" name="VAL_0x02" value="0x02"/>
                <value caption="4" name="VAL_0x03" value="0x03"/>
                <value caption="5" name="VAL_0x04" value="0x04"/>
                <value caption="6" name="VAL_0x05" value="0x05"/>
                <value caption="7" name="VAL_0x06" value="0x06"/>
                <value caption="8" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="LCD_PORT_MASK_4BIT">
                <value caption="SEG0:12" name="VAL_0x00" value="0x00"/>
                <value caption="SEG0:14" name="VAL_0x01" value="0x01"/>
                <value caption="SEG0:15" name="VAL_0x02" value="0x02"/>
                <value caption="SEG0:18" name="VAL_0x03" value="0x03"/>
                <value caption="SEG0:20" name="VAL_0x04" value="0x04"/>
                <value caption="SEG0:22" name="VAL_0x05" value="0x05"/>
                <value caption="SEG0:23" name="VAL_0x06" value="0x06"/>
                <value caption="SEG0:24" name="VAL_0x07" value="0x07"/>
                <value caption="SEG0:26" name="VAL_0x08" value="0x08"/>
                <value caption="SEG0:28" name="VAL_0x09" value="0x09"/>
                <value caption="SEG0:30" name="VAL_0x0A" value="0x0A"/>
                <value caption="SEG0:32" name="VAL_0x0B" value="0x0B"/>
                <value caption="SEG0:34" name="VAL_0x0C" value="0x0C"/>
                <value caption="SEG0:36" name="VAL_0x0D" value="0x0D"/>
                <value caption="SEG0:38" name="VAL_0x0E" value="0x0E"/>
                <value caption="SEG0:39" name="VAL_0x0F" value="0x0F"/>
            </value-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="External Interrupt Control Register A" name="EICRA" offset="0x69" size="1">
                    <bitfield caption="External Interrupt Sense Control 0 Bit 1" mask="0x02" name="ISC01"/>
                    <bitfield caption="External Interrupt Sense Control 0 Bit 0" mask="0x01" name="ISC00" values="INTERRUPT_SENSE_CONTROL"/>
                </register>
                <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
                    <bitfield caption="Pin Change Interrupt Enables" mask="0xF0" name="PCIE"/>
                    <bitfield caption="External Interrupt Request 0 Enable" mask="0x01" name="INT0"/>
                </register>
                <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
                    <bitfield caption="Pin Change Interrupt Flags" mask="0xF0" name="PCIF"/>
                    <bitfield caption="External Interrupt Flag 0" mask="0x01" name="INTF0"/>
                </register>
